function PrivacyPolicy() {
  return (
    <div className="py-36 container">
      Політика конфіденційності для Body Update Дата набрання чинності:
      13.01.2025
      <p>
        У Body Update (&apos;ми&apos;, &apos;наш&apos; або &apos;нас&apos;),
        доступному за адресою https://body-update.com.ua/, конфіденційність
        ваших даних має надзвичайно важливе значення. Ця Політика
        конфіденційності описує, як ми збираємо, використовуємо та захищаємо
        вашу інформацію при використанні наших послуг, включаючи автентифікацію
        через Google OAuth.
      </p>
      <h2 className="text-xl font-bold">1. Інформація, яку ми збираємо</h2>
      <h3>1.1 Особиста інформація</h3>
      <p>
        Коли ви входите на наш вебсайт за допомогою Google OAuth, ми можемо
        збирати наступну інформацію:
      </p>
      <ul>
        <li>Електронну адресу вашого Google-акаунту</li>
        <li>Ім&apos;я вашого профілю Google</li>
        <li>Ваше фото профілю (за наявності)</li>
      </ul>
      <h3>1.2 Автоматично зібрана інформація</h3>
      <p>
        Коли ви отримуєте доступ до нашого вебсайту, ми можемо збирати
        неперсональну інформацію, таку як:
      </p>
      <ul>
        <li>Тип пристрою (наприклад, мобільний або настільний)</li>
        <li>Тип браузера</li>
        <li>IP-адреса</li>
        <li>
          Дані про використання, такі як відвідані сторінки та час перебування
          на сайті
        </li>
      </ul>
      <h2 className="text-xl font-bold">
        2. Як ми використовуємо вашу інформацію
      </h2>
      <p>
        Ми використовуємо зібрану інформацію через Google OAuth та іншими
        способами для:
      </p>
      <ul>
        <li>
          Автентифікації вашої особи та забезпечення безпечного доступу до
          вашого облікового запису
        </li>
        <li>Налаштування вашого досвіду на нашій платформі</li>
        <li>Надання оновлень, пропозицій та іншої релевантної інформації</li>
        <li>Покращення наших послуг та функціональності вебсайту</li>
      </ul>
      <h2>3. Розповсюдження вашої інформації</h2>
      <p>
        Ми не продаємо, не здаємо в оренду та не обмінюємо вашу персональну
        інформацію з третіми сторонами. Однак ми можемо ділитися вашою
        інформацією з:
      </p>
      <ul>
        <li>
          <strong>Постачальниками послуг:</strong> Надійними третіми сторонами,
          які допомагають нам у роботі нашого вебсайту або наданні послуг
          (наприклад, хостинг, аналітика, доставка електронної пошти).
        </li>
        <li>
          <strong>Юридичними органами:</strong> Коли це вимагається законом або
          для захисту наших юридичних прав.
        </li>
      </ul>
      <h2 className="text-xl font-bold">4. Зберігання даних</h2>
      <p>
        Ми зберігаємо вашу персональну інформацію лише протягом часу,
        необхідного для виконання цілей, описаних у цій Політиці
        конфіденційності, якщо інший період зберігання не вимагається або не
        дозволений законом.
      </p>
      <p>
        Якщо ви хочете видалити свій обліковий запис або дані, зверніться до нас
        за адресою [support@body-update.com.ua].
      </p>
      <h2 className="text-xl font-bold">5. Ваші права</h2>
      <p>Ви маєте наступні права щодо вашої персональної інформації:</p>
      <ul>
        <li>
          <strong>Доступ:</strong> Запит доступу до даних, які ми зібрали про
          вас.
        </li>
        <li>
          <strong>Виправлення:</strong> Запит виправлення неточностей у ваших
          персональних даних.
        </li>
        <li>
          <strong>Видалення:</strong> Запит видалення ваших даних за умови
          виконання юридичних зобов&apos;язань.
        </li>
        <li>
          <strong>Відкликання згоди:</strong> Відкликання вашої згоди на обробку
          даних у будь-який час.
        </li>
      </ul>
      <p>
        Для реалізації цих прав звертайтеся до нас за адресою
        [support@body-update.com.ua].
      </p>
      <h2 className="text-xl font-bold">6. Безпека</h2>
      <p>
        Ми вживаємо розумних заходів для захисту вашої інформації від
        несанкціонованого доступу, розкриття або знищення. Однак жодна передача
        через Інтернет або електронне зберігання не є повністю безпечною, тому
        ми не можемо гарантувати абсолютну безпеку.
      </p>
      <h2>7. Сторонні сервіси</h2>
      <p>
        Наш вебсайт може містити посилання на сторонні вебсайти або сервіси. Ця
        Політика конфіденційності не застосовується до таких сервісів, і ми не
        несемо відповідальності за їхні практики конфіденційності. Будь ласка,
        ознайомтеся з їхніми політиками перед наданням будь-якої персональної
        інформації.
      </p>
      <h2 className="text-xl font-bold">8. Google OAuth</h2>
      <p>
        Ми використовуємо Google OAuth для забезпечення безпечної автентифікації
        користувачів. Використовуючи Google OAuth, ви погоджуєтеся з Політикою
        конфіденційності Google (https://policies.google.com/privacy). Ми не
        маємо доступу до ваших облікових даних Google, оскільки процес
        автентифікації здійснюється безпосередньо Google.
      </p>
      <h2 className="text-xl font-bold">
        9. Зміни до цієї Політики конфіденційності
      </h2>
      <p>
        Ми можемо оновлювати цю Політику конфіденційності час від часу. Усі
        зміни будуть опубліковані на цій сторінці із зазначенням оновленої
        &apos;Дати набрання чинності&apos;. Ми рекомендуємо вам періодично
        переглядати цю Політику конфіденційності.
      </p>
      <h2 className="text-xl font-bold">10. Зв&apos;язок з нами</h2>
      <p>
        Якщо у вас є запитання або занепокоєння щодо цієї Політики
        конфіденційності, будь ласка, зв&apos;яжіться з нами:
      </p>
      <ul>
        <li>Електронна пошта: [lf.body.update@gmail.com]</li>
        <li>
          Вебсайт:{" "}
          <a href="https://body-update.com.ua/">https://body-update.com.ua/</a>
        </li>
      </ul>
      <p>
        Використовуючи наші послуги, ви погоджуєтеся з цією Політикою
        конфіденційності.
      </p>
    </div>
  );
}

export default PrivacyPolicy;
